src/cf/InformationRegisters/SystemMessageExchangeSessions.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>SystemMessageExchangeSessions</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>StartDate</Name>
					<Comment>The start date of the session.</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>OperationSuccessful</Name>
					<Comment>Indicates that the session ended successfully</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>OperationFailed</Name>
					<Comment>Indicates that the session ended unsuccessfully</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Data</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ErrorDescription</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Session</Name>
					<Comment>Unique session ID</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/SystemMessageExchangeSessions/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// 
//  
// 
// 
// 
///////////////////////////////////////////////////////////////////////////////////////////////////////

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Private

// Creates a new messaging session and returns its ID
//
Function NewSession() Export
	
	Session = New UUID;
	
	RecordStructure = New Structure("Session, StartDate", Session, CurrentUniversalDate());
	
	AddRecord(RecordStructure);
	
	Return Session;
EndFunction

// Gets the session status: Running, Successful, Error.
//
Function SessionStatus(Val Session) Export
	
	QueryText =
	"SELECT
	|	CASE
	|		WHEN SystemMessageExchangeSessions.OperationFailed
	|			THEN ""Error""
	|		WHEN SystemMessageExchangeSessions.OperationSuccessful
	|			THEN ""Success""
	|		ELSE ""Running""
	|	END AS Result
	|FROM
	|	InformationRegister.SystemMessageExchangeSessions AS SystemMessageExchangeSessions
	|WHERE
	|	SystemMessageExchangeSessions.Session = &Session";
	Record = RecordMessagesExchangeSession(QueryText, Session);
	
	Return Record.Result;
	
EndFunction

// Marks the successful completion of the session
//
Procedure CommitSuccessfulSession(Val Session) Export
	
	RecordStructure = New Structure;
	RecordStructure.Insert("Session", Session);
	RecordStructure.Insert("OperationSuccessful", True);
	RecordStructure.Insert("OperationFailed", False);
	
	UpdateRecord(RecordStructure);
	
EndProcedure

// Notes the failure of the session
//
Procedure CommitUnsuccessfulSession(Val Session, Val ErrorDescription = "") Export
	
	RecordStructure = New Structure;
	RecordStructure.Insert("Session", Session);
	RecordStructure.Insert("OperationSuccessful", False);
	RecordStructure.Insert("OperationFailed", True);
	RecordStructure.Insert("ErrorDescription", ErrorDescription);
	
	UpdateRecord(RecordStructure);
	
EndProcedure

// Saves session data and marks the successful completion of the session
//
Procedure SaveSessionData(Val Session, Data) Export
	
	RecordStructure = New Structure;
	RecordStructure.Insert("Session", Session);
	RecordStructure.Insert("Data", Data);
	RecordStructure.Insert("OperationSuccessful", True);
	RecordStructure.Insert("OperationFailed", False);
	UpdateRecord(RecordStructure);
	
EndProcedure

// Retrieves session data and deletes the session from the database
//
Function GetSessionData(Val Session) Export
	
	QueryText =
	"SELECT
	|	SystemMessageExchangeSessions.Data AS Data
	|FROM
	|	InformationRegister.SystemMessageExchangeSessions AS SystemMessageExchangeSessions
	|WHERE
	|	SystemMessageExchangeSessions.Session = &Session";
	
	BeginTransaction();
	Try
		Block = New DataLock;
		LockItem = Block.Add("InformationRegister.SystemMessageExchangeSessions");
		LockItem.SetValue("Session", Session);
		Block.Lock();
		
		Record = RecordMessagesExchangeSession(QueryText, Session);
		
		Result = Record.Data;
		
		DeleteRecord(Session);
		
		CommitTransaction();
	Except
		RollbackTransaction();
		Raise;
	EndTry;
	
	Return Result;
	
EndFunction

// 
//
Function SessionErrorDetails(Val Session) Export
	
	QueryText =
		"SELECT
		|	SystemMessageExchangeSessions.ErrorDescription AS ErrorDescription
		|FROM
		|	InformationRegister.SystemMessageExchangeSessions AS SystemMessageExchangeSessions
		|WHERE
		|	SystemMessageExchangeSessions.Session = &Session";
	
	Record = RecordMessagesExchangeSession(QueryText, Session);
	
	Return Record.ErrorDescription;
	
EndFunction

// 

Function RecordMessagesExchangeSession(QueryText, Session)
	
	Query = New Query(QueryText);
	Query.SetParameter("Session", Session);
	
	Selection = Query.Execute().Select();
	
	If Not Selection.Next() Then
		Raise StringFunctionsClientServer.SubstituteParametersToString(
			NStr("en = 'System message exchange session with ID %1 not found.';"),
			String(Session));
	EndIf;
	
	Return Selection;
	
EndFunction

Procedure AddRecord(RecordStructure)
	
	DataExchangeInternal.AddRecordToInformationRegister(RecordStructure, "SystemMessageExchangeSessions");
	
EndProcedure

Procedure UpdateRecord(RecordStructure)
	
	DataExchangeInternal.UpdateInformationRegisterRecord(RecordStructure, "SystemMessageExchangeSessions");
	
EndProcedure

Procedure DeleteRecord(Val Session)
	
	DataExchangeInternal.DeleteRecordSetFromInformationRegister(New Structure("Session", Session), "SystemMessageExchangeSessions");
	
EndProcedure

#EndRegion

#EndIf
